[
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_1",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\nBank Pricing and General Conditions Policy",
    "token_count": 9,
    "created_at": "2025-11-01T15:50:46.127505"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_2",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\nDate: January 2025\nInternal Document – Demonstration Use Only",
    "token_count": 14,
    "created_at": "2025-11-01T15:50:46.127505"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_3",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n1. Purpose and Scope\nThis Bank Pricing and General Conditions Policy establishes the overall framework governing the setting, communication, and review of the tariffs applied by FinSight Bank to all clients. It reflects the principles of transparency, fairness, and consumer protection defined by the Central Bank of Tunisia (BCT), notably through Circular No. 2018-12 on banking transparency, and in compliance with Law No. 2016-48 of July 11, 2016, regulating credit institutions.\nThis policy applies to all banking operations conducted within FinSight Bank’s network — in-branch, remotely, through digital platforms, or any authorized distribution channel. It covers both retail and corporate clients, including SMEs and professionals.\nThe objective is to ensure national tariff consistency, regulate billing practices, and prevent opacity or abusive pricing. It serves as the Bank’s single internal reference for the development, approval, and publication of tariff schedules. All employees must comply with its provisions.",
    "token_count": 193,
    "created_at": "2025-11-01T15:50:46.127505"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_4",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n2. Principles of Transparency and Compliance\nThe policy is based on full transparency toward clients, in line with Article 56 of the Banking Law and BCT directives on financial consumer protection. FinSight Bank commits to clearly and comprehensibly communicating all applicable fees, commissions, and charges prior to any subscription or operation.\nTariffs are expressed in Tunisian Dinars (TND), excluding taxes unless otherwise indicated. Application conditions (frequency, thresholds, ceilings, free services, promotional discounts) are specified in the tariff schedules available in branches and on digital channels.\nFinSight Bank adheres to equal treatment for clients with identical profiles and products, except for specific conditions explicitly approved by General Management. Any tariff modification must be announced at least 30 days in advance and communicated electronically or via branch notices.\nTariff compliance is supervised by the Compliance and Client Protection Department, which ensures adherence to applicable regulations and BCT recommendations. The Risk Department verifies that tariff policies remain consistent with the Bank’s prudential and profitability strategy.",
    "token_count": 209,
    "created_at": "2025-11-01T15:50:46.127505"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_5",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n3. Governance and Approval of Tariffs\nTariff governance follows a structured and collegial process ensuring rigor and institutional consistency.\nThe Product and Market Department proposes initial tariffs based on cost analysis, competitive benchmarking, and client sensitivity assessment. Each proposal must include a justification note detailing margin assumptions, projected volumes, and impact on net interest income.\nProposals are reviewed by the Tariff and Banking Conditions Committee, chaired by the Deputy CEO for Commercial Development, and including representatives from Finance, Compliance, Risk, and Marketing. Decisions are recorded in official minutes and submitted to the Governance Committee for final approval.\nAll tariff revisions—upward or downward—require Governance Committee approval after Compliance review. Major modifications (interest rates, international operation fees, account maintenance charges) must also be communicated to the BCT per Circular No. 2020-05.\nInternal Audit regularly verifies correct tariff application, consistency between displayed and charged fees, and traceability of decisions. Findings are reported semiannually to the Audit Committee and included in FinSight Bank’s regulatory compliance report.",
    "token_count": 211,
    "created_at": "2025-11-01T15:50:46.127505"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_6",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n4. Tariff Setting Methodology\nTariff determination follows a structured methodology balancing three dimensions: cost of service, perceived client value, and regulatory compliance.\nFinSight Bank establishes base tariffs using direct operational costs (HR, infrastructure, IT, intermediation costs) plus a coverage margin proportional to the product’s risk and nature.\nFor regulated-rate products (e.g., savings accounts, subsidized loans, financial inclusion products), tariffs follow BCT-established limits. For market-based products, differentiated pricing applies based on client segment and service level.\nTariff schedule design principles include:\n• Internal consistency between similar products;\n• Proportionality between service complexity and price;\n• Market competitiveness through reasonable alignment with sector averages;\n• Accessibility, ensuring affordable basic banking services for vulnerable populations in line with financial inclusion objectives.\nFees and commissions are grouped into three categories:\n1. Account maintenance and payment means fees (periodic);\n2. Transaction-based service commissions (transfers, withdrawals, statements, certificates);\n3. Risk and intervention commissions (overdrafts, payment incidents, FX operations).\nAll calculations are centralized in the FinSight Pricing Engine, ensuring automation, accuracy, and traceability. The system interfaces with internal controls to detect anomalies.",
    "token_count": 257,
    "created_at": "2025-11-01T15:50:46.139050"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_7",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n5. Retail Banking Services Pricing\nRetail banking tariffs balance affordability, service quality, and operational cost recovery. Account maintenance fees are charged monthly, covering transaction management, statement provision, and digital access. As of 2025, the reference rate is 6.000 TND per month, with full exemption for basic savings accounts and clients earning less than 800 TND monthly.\nCard fees vary by product tier: Visa Classic – 45.000 TND/year, Visa Gold – 90.000 TND/year, Visa Platinum – 150.000 TND/year. Fees include automatic renewal and basic insurance coverage.\nDomestic transfers are priced at 2.000 TND per transaction; international transfers at 0.15% of the amount (min. 30.000 TND, max. 300.000 TND). Interbank ATM withdrawals incur a 1.500 TND fee. Bundled packages (account + card + digital banking) start at 90.000 TND/year.\nTariffs are displayed in all branches and on the Bank’s website. Specific product terms (credit, savings, investment) are detailed in individual contracts.",
    "token_count": 231,
    "created_at": "2025-11-01T15:50:46.141056"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_8",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n6. SME and Professional Services Pricing\nFor professional and SME clients, tariffs reflect operation volume, service level, and risk profile. FinSight Bank offers a full range of services: current accounts, working capital loans, investment financing, factoring, and international payment solutions.\nProfessional account maintenance: 15.000 TND/month, including cash management and FinSight ProBank digital access. Domestic business transfers: 3.500 TND per transaction; international transfers: 0.20% (min. 50.000 TND). Commercial collections (checks, bills) are charged 0.30% (capped at 250.000 TND). Forward FX operations include a 0.08% margin over interbank rate.\nThe “Business+” SME package (account + card + digital access) is priced at 480.000 TND/year, designed for transparency and budget predictability.",
    "token_count": 183,
    "created_at": "2025-11-01T15:50:46.141056"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_9",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n7. Commissions and Penalties\nCommissions and penalties are regulated and aim to cover administrative costs. Application follows BCT Circular No. 2018-12 and proportionality principles.\n• Overdraft/incident intervention fee: 8.000 TND per operation, capped at 80.000 TND/month per account.\n• Dishonored check fees: 25.000 TND (insufficient funds), 50.000 TND (unauthorized stop payment).\n• Urgent same-day transfer: 10.000 TND.\n• Credit late payment penalty: BCT reference rate + 5 points (within legal ceiling).\n• Manual FX exchange: 1% of amount (min. 10.000 TND).\n• Account closure: 20.000 TND (retail), 50.000 TND (professional).",
    "token_count": 165,
    "created_at": "2025-11-01T15:50:46.143424"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_10",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n8. Tariff Review and Indexation\nTariffs are reviewed annually in line with economic trends, regulatory updates, and the Group’s strategic plan. Adjustments consider Money Market Average Rate (TMM), inflation, operating costs, and market competitiveness.\nSignificant changes require financial impact analysis, Tariff Committee validation, and General Management approval before BCT notification. Variable-rate products adjust automatically with TMM changes, as stated in client contracts.\nRevisions are non-retroactive and announced before implementation.",
    "token_count": 100,
    "created_at": "2025-11-01T15:50:46.143424"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_11",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n9. Client Communication and Display\nTariff communication is central to transparency and client trust. FinSight Bank ensures permanent public display of tariff schedules in branches, on the website, and mobile apps (per BCT Circular No. 2018-12).\nChanges are announced 30 days in advance via email, SMS, or digital notification. Clients are deemed to accept new conditions unless explicitly objected to before the effective date.\nRelationship managers must provide each client with a personalized tariff summary. Billing complaints are resolved within 10 business days under Compliance supervision.",
    "token_count": 108,
    "created_at": "2025-11-01T15:50:46.143424"
  },
  {
    "doc_id": "Bank_Pricing_and_General_Conditions_Policy_EN",
    "chunk_id": "Bank_Pricing_and_General_Conditions_Policy_EN_12",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Bank Pricing And General Conditions Policy En",
    "text": "None\n10. Final Provisions\nThis policy takes effect February 1, 2025, and is reviewed annually each December following Tariff Committee and Board approval. Any breach in application or communication constitutes regulatory non-compliance and may result in disciplinary measures.\nThe Bank cooperates with the BCT and external auditors during tariff-related reviews. The official version is available at headquarters and electronically via the institutional intranet.\nThis policy reflects FinSight Bank’s commitment to transparency, fairness, and accountability. It is a key component of financial stability, client protection, and long-term competitiveness.",
    "token_count": 117,
    "created_at": "2025-11-01T15:50:46.146387"
  }
]