[
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_1",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\nCompliance and Sanctions Management Policy",
    "token_count": 8,
    "created_at": "2025-11-02T15:37:04.509161"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_2",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n1. Preamble This Compliance and Sanctions Management Policy establishes the reference framework defining the principles, responsibilities, and procedures applicable within FinSight Bank to ensure compliance with legal, regulatory, and ethical obligations, as well as to prevent financial crimes, money laundering, terrorist financing, and fraud. It aligns with the provisions of Central Bank of Tunisia Circular No. 2021-04, the recommendations of the Tunisian Financial Analysis Commission (CTAF), and international standards set by the Financial Action Task Force (FATF). The fundamental objective of this policy is to preserve the integrity, reputation, and sustainability of FinSight Bank through a robust compliance framework, continuous control of non-compliance risks, and rigorous management of national and international sanctions.",
    "token_count": 149,
    "created_at": "2025-11-02T15:37:04.537124"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_3",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n2. Principles and Scope of Application Compliance is a key pillar of banking governance. It ensures that all activities, operations, and decisions of FinSight Bank are conducted in strict adherence to applicable laws, regulations, and professional standards. This policy applies to all employees, managers, subsidiaries, branches, and partners of the Bank. It covers all areas exposed to regulatory or reputational risk, including anti-money laundering and counter-terrorism financing (AML/CFT), conflict of interest prevention, personal data protection, tax compliance, and management of economic and financial sanctions. Every employee of FinSight Bank is required to immediately report any suspicious situation or non-compliant behavior to the Compliance Department. Adherence to this policy is a professional obligation; violation may result in disciplinary measures and, where applicable, legal proceedings.",
    "token_count": 164,
    "created_at": "2025-11-02T15:37:04.563572"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_4",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n3. Organization of the Compliance Function The Compliance Function reports directly to General Management and maintains a functional relationship with the Risk and Compliance Committee of the Board of Directors. It operates independently, both hierarchically and operationally, and has unrestricted access to all information necessary to perform its duties. Its mission is to identify, assess, monitor, and mitigate non-compliance risks faced by the Bank. To achieve this, the function implements an integrated system comprising: – Continuous regulatory and standards monitoring; – Periodic non-compliance risk assessment; – Implementation of internal procedures and adapted control plans; – Staff awareness and training programs; – Supervision of suspicious transaction reports to the CTAF; – Monitoring of alerts generated by the automated surveillance system. The independence of the Compliance Function is guaranteed by a compliance charter approved by the Board of Directors. Periodic reports prepared by the Compliance Department are submitted to General Management, the Risk Committee, and, if necessary, supervisory authorities.",
    "token_count": 193,
    "created_at": "2025-11-02T15:37:04.605543"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_5",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n4. Anti-Money Laundering, Counter-Terrorism Financing, and Fraud Prevention FinSight Bank applies a strict Anti-Money Laundering and Counter-Terrorism Financing (AML/CFT) policy aligned with the obligations of the CTAF and FATF. The Bank adopts a risk-based approach, assessing the probability and potential impact of each risk typology before adapting the corresponding vigilance measures. Customer identification and verification (KYC – Know Your Customer) are systematic and conducted before establishing any business relationship. Clients, beneficial owners, and authorized representatives are automatically screened against politically exposed persons (PEPs) and international sanctions lists. Any transaction that appears unusual, inconsistent with the customer profile, or suspected of concealing illicit funds undergoes an in-depth analysis and, where applicable, is reported to the CTAF in accordance with current legislation. Fraud prevention, both internal and external, forms an integral part of the compliance framework. FinSight Bank deploys behavioral detection tools, cross-transactional controls, and hierarchical alert mechanisms. Confirmed cases of fraud are systematically reported to General Management and the Audit Committee for evaluation and disciplinary action.",
    "token_count": 229,
    "created_at": "2025-11-02T15:37:04.660560"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_6",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n5. Management of International Financial Sanctions FinSight Bank strictly complies with economic and financial sanctions regimes issued by the United Nations, the European Union, the United States (OFAC), and any other relevant authority. The Bank maintains a consolidated and regularly updated list of sanctioned persons, entities, and jurisdictions integrated into its automated screening systems. Any transaction involving a country, entity, or individual appearing on these lists is blocked, analyzed, and submitted to the Compliance Department for a decision. Release of a blocked transaction may occur only upon explicit and documented authorization. The Compliance Function also conducts enhanced monitoring of high-risk clients, particularly PEPs and companies operating in sensitive sectors. Enhanced Due Diligence (EDD) reports are prepared for such clients, and business relationships may only continue following high-level validation.",
    "token_count": 165,
    "created_at": "2025-11-02T15:37:04.688431"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_7",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n6. Prevention of Conflicts of Interest and Professional Integrity FinSight Bank places utmost importance on preventing conflicts of interest, defined as any divergence between an employee’s personal interests and those of the Bank or its clients. Every employee must declare any situation that could compromise their independence or damage the Bank’s reputation. Decisions regarding credit, investment, or partnership approvals are governed by strict approval procedures that preclude any personal or external influence. Employees are also bound by strict ethical obligations regarding professional secrecy, information confidentiality, and the non-use of privileged information. Violation of these principles constitutes serious misconduct, potentially leading to termination and legal action.",
    "token_count": 132,
    "created_at": "2025-11-02T15:37:04.709182"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_8",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n7. Control and Reporting Framework Compliance is subject to continuous monitoring and structured reporting. Each quarter, the Compliance Department prepares a consolidated report summarizing key indicators: number of alerts processed, cases reported to the CTAF, non-compliance incidents, training sessions conducted, and corrective measures implemented. These reports are presented to the Risk Committee and General Management, then submitted to the Board of Directors for validation. Additionally, an annual compliance audit is carried out to assess the effectiveness of the framework. Audit conclusions and recommendations are incorporated into the internal remediation plan and tracked until full resolution.",
    "token_count": 121,
    "created_at": "2025-11-02T15:37:04.723027"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_9",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n8. Training, Awareness, and Compliance Culture The success of the compliance framework relies on a strong institutional culture. FinSight Bank considers compliance everyone’s responsibility. Each employee, regardless of position, must demonstrate ethical, diligent, and transparent behavior. Annual initial and ongoing training programs are organized to strengthen staff competencies in AML/CFT, sanctions management, fraud prevention, and regulatory obligations. Internal awareness campaigns regularly remind staff of proper conduct in case of suspected anomalies or incidents.",
    "token_count": 103,
    "created_at": "2025-11-02T15:37:04.737027"
  },
  {
    "doc_id": "Compliance_and_Sanctions_Management_Policy_EN",
    "chunk_id": "Compliance_and_Sanctions_Management_Policy_EN_10",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Compliance And Sanctions Management Policy En",
    "text": "None\n9. Revision and Entry into Force This policy is reviewed annually or following any change in Tunisian or international regulatory frameworks. Updates are approved by the Board of Directors upon recommendation of the Risk and Compliance Committee. It enters into force on January 1, 2025, and supersedes all previous versions. Compliance with this policy is mandatory for all employees, partners, and subcontractors of FinSight Bank. Any violation of this policy may result in internal disciplinary action or criminal prosecution, in accordance with applicable legislation.",
    "token_count": 106,
    "created_at": "2025-11-02T15:37:04.750978"
  }
]