[
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_1",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\nProvisioning and Credit Commitment Monitoring Policy\nDate: January 2025\nInternal Document – Demonstration Use Only",
    "token_count": 21,
    "created_at": "2025-10-25T14:29:35.326032"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_2",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n1. Purpose and Scope\n   This policy defines the general framework governing the constitution of credit risk provisions and the monitoring of credit commitments granted by FinSight Bank. It aims to ensure the reliability of financial statements, transparency in credit management, and compliance with the regulatory requirements of the Central Bank of Tunisia (BCT).\n   It applies to all operations generating credit risk, including loans, overdrafts, guarantees, letters of credit, investment financing, or similar facilities. It also covers post-disbursement monitoring, periodic reviews, detection of deterioration indicators, and loan reclassification.\n   Provisioning is a key element of the prudential framework. It reflects the accounting principle of prudence and ensures coverage of probable or incurred losses within credit portfolios. This policy complements the 2025 General Credit Policy by specifying its provisions related to credit risk and asset impairment.\n   It is mandatory for all departments, branches, and subsidiaries operating under FinSight Bank’s authority, including foreign branches (subject to local adaptations).",
    "token_count": 207,
    "created_at": "2025-10-25T14:29:35.326583"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_3",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n2. Regulatory Basis and References\n   The regulatory framework for provisioning and credit monitoring is primarily based on BCT circulars and regulations, including:\n   • BCT Circular No. 91-24 (Dec 17, 1991) – Classification of loans and provisioning rules;\n   • BCT Circular No. 2013-21 – Governance and credit risk management;\n   • BCT Circular No. 2021-01 – Calculation and recognition of collective provisions;\n   • Law No. 2016-48 on credit institutions and financial organizations.\n   This policy also complies with IFRS 9 standards on financial instrument impairment while adhering to Tunisian prudential requirements.\n   FinSight Bank supplements these with internal procedures defined by the Risk Department and approved by the Credit Governance Committee, specifying calculation methods, thresholds, review processes, and documentation standards.",
    "token_count": 163,
    "created_at": "2025-10-25T14:29:35.327263"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_4",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n3. Credit Risk Management Principles\n   Credit risk management is based on prudence, consistency, and traceability. FinSight Bank identifies, measures, and covers potential losses from counterparties unable to meet obligations.\n   Provisioning is preventive, reflecting the true quality of the credit portfolio and ensuring the Bank’s financial stability. Provisions are accounting charges for probable losses and are regularly reviewed.\n   Consistency over time is ensured through uniform application of provisioning rules. Each provision must be fully documented and justified.\n   Two types of provisions are distinguished:\n   • Specific provisions: for individually identified risky exposures;\n   • Collective provisions: for latent risks on performing loans.\n   The Risk Department supervises methodological consistency, while the Finance Department ensures accurate accounting and regulatory recording. Both are subject to periodic Internal Audit and external auditor review.",
    "token_count": 162,
    "created_at": "2025-10-25T14:29:35.327842"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_5",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n4. Credit Classification\n   In line with BCT Circular No. 91-24, exposures are classified into five categories based on risk level and customer condition, using objective criteria such as payment delays, solvency, collateral, and recovery outlook.\n   • Class 0 – Performing Loans: Regular payments, no incidents.\n   • Class 1 – Watchlist: Delay < 30 days or early risk signals.\n   • Class 2 – Substandard: Delay 30–90 days or clear financial difficulty.\n   • Class 3 – Doubtful: Delay > 90 days, uncertain recovery despite guarantees.\n   • Class 4 – Loss: Unrecoverable, liquidation or client default.\n   All exposures above Class 0 require written justification outlining deterioration factors, planned measures, and available guarantees. Reclassifications are automated by FinSight Risk Monitor, based on payment behavior, internal rating, and alerts. Improvements may lead to upward reclassification upon Credit Committee approval.",
    "token_count": 189,
    "created_at": "2025-10-25T14:29:35.328514"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_6",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n5. Provisioning Methodology\n   FinSight Bank applies a hybrid approach combining BCT requirements and IFRS 9 expected credit loss (ECL) principles.\n   Provisions are calculated as Exposure at Default (EAD) × Probability of Default (PD) × Loss Given Default (LGD), adjusted by internal factors (sector, duration, collateral quality).\n   Minimum provisioning rates set by BCT:\n   • Class 1: 5%\n   • Class 2: 20%\n   • Class 3: 50%\n   • Class 4: 100%\n   Collective provisions cover latent risks on performing loans (Class 0) at 1% of total performing exposures, weighted by sectoral risk (0.5% for public sector, up to 1.5% for high-risk SMEs).\n   Provisions are updated quarterly, with recalculations triggered automatically via the FinSight Provisions Engine when portfolio changes occur (new exposures, deterioration, recoveries).\n   All amounts are validated by the Credit Governance Committee before inclusion in regulatory statements and quarterly BCT reporting.",
    "token_count": 210,
    "created_at": "2025-10-25T14:29:35.329149"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_7",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n6. Provisioning Governance\n   Provisioning governance is based on separation of duties, independence, and internal control.\n   The Board of Directors defines strategic guidelines, approves this policy, and reviews quarterly consolidated reports on provisions and portfolio quality.\n   General Management ensures operational implementation and sufficiency of provisions. The Credit Governance Committee oversees classification, validations, and adjustments, maintaining official meeting records.\n   The Risk Department monitors portfolio quality, prepares provisioning reports, and proposes adjustments. The Finance Department ensures proper accounting integration. Internal Audit verifies data integrity, accuracy, and process compliance.",
    "token_count": 116,
    "created_at": "2025-10-25T14:29:35.329682"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_8",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n7. Monitoring and Review of Commitments\n   Monitoring commitments is central to credit risk control. FinSight Bank uses an early-warning, proactive approach with periodic reviews.\n   Review Frequency:\n   • Class 0: Annual\n   • Class 1: Quarterly\n   • Classes 2–3: Monthly\n   • Class 4: Continuous (until write-off)\n   Each review includes updated financial analysis, collateral verification, payment behavior, and sectoral assessment. Results are logged in FinSight Risk Monitor.\n   Deteriorations (delays, revenue drop, litigation, guarantee withdrawal) must be immediately reported to the Risk Department. Additional provisioning or reclassification requires Credit Committee approval.\n   Portfolio evolution (by segment, region, and risk class) is presented in quarterly dashboards for senior management and supervisory reporting.",
    "token_count": 152,
    "created_at": "2025-10-25T14:29:35.330261"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_9",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n8. Treatment of Non-Performing and Doubtful Loans\n   Loans in Classes 2–4 follow specific recovery and legal procedures under BCT regulation.\n   Upon delays >30 days or financial distress, the Recovery Department takes over, drafting restructuring or recovery plans (rescheduling, collateral activation, legal action).\n   • Class 3 loans: Minimum 50% provision;\n   • Class 4 loans: 100% provision (write-off after full recovery attempts).\n   Restructured loans are re-evaluated periodically and may be reclassified after 12 months of regular payment. The Legal Department manages litigation, ensuring accounting recognition of losses.",
    "token_count": 123,
    "created_at": "2025-10-25T14:29:35.330824"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_10",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n9. Reporting and Regulatory Control\n   FinSight Bank submits quarterly reports to the BCT detailing:\n   • Distribution of exposures by risk class;\n   • Total specific and collective provisions;\n   • Changes in provisions and reclassifications;\n   • Details of restructured, litigated, and written-off loans.\n   Reports are generated by the Finance Department, validated by the Risk Department, and transmitted via the BCT Online Reporting platform.\n   A consolidated report is submitted to the Audit Committee and Board, including coverage ratios and sectoral trends. Internal Audit and external auditors verify compliance with BCT and IFRS requirements.",
    "token_count": 125,
    "created_at": "2025-10-25T14:29:35.331255"
  },
  {
    "doc_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN",
    "chunk_id": "Provisioning_and_Credit_Commitment_Monitoring_Policy_EN_11",
    "chunk_type": "paragraph",
    "section": null,
    "title": "Provisioning And Credit Commitment Monitoring Policy En",
    "text": "None\n10. Final Provisions\n    This policy takes effect on January 1, 2025, and is reviewed annually in Q4 to incorporate regulatory and audit updates.\n    Changes in methodology, rates, or reclassification rules require approval from the Credit Governance Committee and validation by General Management.\n    FinSight Bank commits to maintaining a minimum coverage ratio of 90% for classified exposures, monitored quarterly by the Risk Department and reported to the Board.\n    By adopting this policy, FinSight Bank reaffirms its commitment to prudent, transparent, and proactive credit risk management, ensuring financial soundness and lasting stakeholder confidence.",
    "token_count": 124,
    "created_at": "2025-10-25T14:29:35.331659"
  }
]